<?php

namespace Database\Seeders;
 
use App\Models\plants;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PlantSeeder extends Seeder
{
    public function run()
    {
        $data = [
            ["plant" => "BG", "bu" => "บริษัท บางกอกกล๊าส จำกัด (มหาชน)"],
            ["plant" => "BGC", "bu" => "บริษัท บีจี คอนเทนเนอร์ กล๊าส จำกัด (มหาชน)"],
            ["plant" => "BGE", "bu" => "บริษัท บีจี เอ็นเนอร์ยี่ โซลูชั่น จำกัด"],
            ["plant" => "BGPU", "bu" => "บริษัท บีจี คอนเทนเนอร์ กล๊าส จำกัด (มหาชน)"],
            ["plant" => "PTI", "bu" => "บริษัท ปทุมธานีกล๊าส อินดัสทรี จำกัด"],
            ["plant" => "RBI", "bu" => "บริษัท ราชบุรีกล๊าส อินดัสทรี จำกัด"],
            ["plant" => "AGI", "bu" => "บริษัท อยุธยากล๊าส อินดัสทรี จำกัด"],
            ["plant" => "PGI", "bu" => "บริษัท ปราจีนบุรีกล๊าส อินดัสทรี จำกัด"],
            ["plant" => "BGCG", "bu" => "บริษัท บีจีซี กล๊าส โซลูชั่น จำกัด"],
            ["plant" => "BGP-AY1", "bu" => "บริษัท บีจี แพคเกจจิ้ง จำกัด"],
            ["plant" => "BGP-AY2", "bu" => "บริษัท บีจี แพคเกจจิ้ง จำกัด (สาขาอยุธยา)"],
            ["plant" => "BVP", "bu" => "บริษัท บางกอกบรรจุภัณฑ์ จำกัด"],
            ["plant" => "BGF", "bu" => "บริษัท บีจี อลูมิเนียม จำกัด"],
            ["plant" => "KBI", "bu" => "บริษัท กบินทร์บุรีกล๊าส อินดัสทรี จำกัด"],
            ["plant" => "WTM", "bu" => "บริษัท บีจีซี กล๊าส โซลูชั่น จำกัด"],
            ["plant" => "WTN", "bu" => "บริษัท บีจีซี กล๊าส โซลูชั่น จำกัด"],
            ["plant" => "/A", "bu" => "บริษัท บีจีซี กล๊าส โซลูชั่น จำกัด"],
            ["plant" => "BGCP", "bu" => "บริษัท บีจีซี แพคเกจจิ้ง จำกัด"],
            ["plant" => "PRIME", "bu" => "บริษัท ไพร์ม แพ็คเกจจิ้ง จำกัด"],
            ["plant" => "BGES", "bu" => "บริษัท บีจี เอ็นซิส จำกัด"],
        ];

        foreach ($data as $row) {
            plants::create(["plant" => $row['plant'], "bu" => $row['bu']]);
        }
    }
}
